In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\lenovo\anaconda3\lib\site-packages (1.4.4)
Requirement already satisfied: pytz>=2020.1 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: numpy>=1.18.5 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\lenovo\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [2]:
import os

In [3]:
os.getcwd()

'C:\\Users\\Lenovo\\Desktop\\MyCourse\\Python-for-data-science'

In [17]:
import pandas as pd
import numpy as np

# 1.creating a dataframe from an array

## 1.1 OPTION 1

In [6]:
#creating an array
data = np.array([[1,4],[2,5],[3,6]])

In [9]:
#creating dataframe
df=pd.DataFrame(data, index=['row1','row2','row3'],columns = ['col1','col2'])

In [10]:
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

## 1.2 OPTION 2

In [11]:
#creating an array
data = [[1,4],[2,5],[3,6]]

In [12]:
#creating dataframe
df=pd.DataFrame(data, index=['row1','row2','row3'],columns = ['col1','col2'])

In [13]:
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

# 2 Creating a dataframe from a dictionary

In [7]:
#list used for this example
states= ['california','texas','Florida',"New York"]
population = [39613493,29730311,21944577,19299981]

In [8]:
# sorting list within a dictionary
dict_states = {'States':states,'Population':population}

In [9]:
# creating a dataframe
df = pd.DataFrame(dict_states)

In [10]:
# showing the dataframe
df

       States  Population
0  california    39613493
1       texas    29730311
2     Florida    21944577
3    New York    19299981

In [11]:
df_population = pd.DataFrame(dict_states)

In [12]:
df_population

       States  Population
0  california    39613493
1       texas    29730311
2     Florida    21944577
3    New York    19299981

# 3 Creating a dataframe using csv file

In [20]:
#reading csv file
df_exams=pd.read_csv('StudentsPerformance.csv')

In [21]:
# reading the first 5 rows
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [23]:
df_exams.tail() #the last 5 rows

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [24]:
#getting shape attribute
df_exams.shape

(1000, 8)

In [25]:
!git init

Reinitialized existing Git repository in C:/Users/Lenovo/Desktop/MyCourse/Python-for-data-science/.git/

In [26]:
!git add .

warning: in the working copy of '.ipynb_checkpoints/DATAFRAME-checkpoint.ipynb', LF will be replaced by CRLF the next time Git touches it
warning: in the working copy of 'DATAFRAME.ipynb', LF will be replaced by CRLF the next time Git touches it
warning: in the working copy of 'StudentsPerformance.csv', LF will be replaced by CRLF the next time Git touches it

In [27]:
!git commit -m "accessing dataframes"

[main (root-commit) 7abc884] accessing dataframes
 3 files changed, 2539 insertions(+)
 create mode 100644 .ipynb_checkpoints/DATAFRAME-checkpoint.ipynb
 create mode 100644 DATAFRAME.ipynb
 create mode 100644 StudentsPerformance.csv

In [28]:
!git push -u origin main

branch 'main' set up to track 'origin/main'.

To https://github.com/SUSH9391/Python-for-data-science.git
 * [new branch]      main -> main

# 1 Attributes

In [30]:
# getting access to the shape attribute, shape attribute returns the number of rows and colums in a dataframe in ('rows','columns') format
df_exams.shape

(1000, 8)

In [31]:
 #getting access to the index attribute 
df_exams.index

RangeIndex(start=0, stop=1000, step=1)

In [33]:
#getting access to column attribute
df_exams.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [35]:
#data types of object
df_exams.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

# 2 Methods

In [36]:
# showing the info of the dataframe
df_exams.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [37]:
df_exams.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

# 3 Functions

In [38]:
#obtaining the length of the dataframe (no. of rows)
len(df_exams)

1000

In [39]:
# obtaing the highest index of the dataframe
max(df_exams.index)

999

In [40]:
#obtaining the datatype of dataframe
type(df_exams)

pandas.core.frame.DataFrame

In [41]:
# rounding the values of df
round(df_exams,2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

# Selecting 1 columns

# 1.1 syntax 1

In [42]:
#selecting a column with [] (prefferred way to select a column)
df_exams['gender']

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [43]:
# check out the data type of a column
type(df_exams['gender'])

pandas.core.series.Series

In [44]:
df_exams['gender'].index

RangeIndex(start=0, stop=1000, step=1)

In [45]:
df_exams['gender'].head()

0    female
1    female
2    female
3      male
4      male
Name: gender, dtype: object

## 1.2 Syntax 2

In [46]:
df_exams.gender

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [47]:
#pitfalls of this syntax
df_exams.math score

SyntaxError: invalid syntax (641069450.py, line 2)

In [48]:
df_exams['math score']

0      72
1      69
2      90
3      47
4      76
       ..
995    88
996    62
997    59
998    68
999    77
Name: math score, Length: 1000, dtype: int64

# Selecting 2 or more columns

In [49]:
# selecting 2 colums using [[]]
df_exams[['gender','math score']]

     gender  math score
0    female          72
1    female          69
2    female          90
3      male          47
4      male          76
..      ...         ...
995  female          88
996    male          62
997  female          59
998  female          68
999  female          77

[1000 rows x 2 columns]

 # Adding a new column with scalar value

In [50]:
df_exams['langauge_score']=78

In [51]:
df_exams['langauge_score']

0      78
1      78
2      78
3      78
4      78
       ..
995    78
996    78
997    78
998    78
999    78
Name: langauge_score, Length: 1000, dtype: int64

# adding new value / col uing array

In [53]:
import numpy as np

In [54]:
langauge_score= np.arange(0,1000)

In [55]:
len(langauge_score)

1000

In [56]:
df_exams['langauge_score'] = langauge_score

In [58]:
df_exams['langauge_score']

0        0
1        1
2        2
3        3
4        4
      ...
995    995
996    996
997    997
998    998
999    999
Name: langauge_score, Length: 1000, dtype: int32

In [62]:
int_langauge_score=np.random.randint(1,100,size=1000)

In [63]:
min(int_langauge_score)

1

In [64]:
df_exams['langauge_score'] = int_langauge_score

In [65]:
df_exams['langauge_score']

0       4
1      28
2      60
3      73
4      70
       ..
995    69
996    16
997    98
998    85
999    31
Name: langauge_score, Length: 1000, dtype: int32

# Adding new values to the dataframe using methods

## 1.1 assign()

In [66]:
!git commit -u "assigning new features to existing one using methods"

error: pathspec 'assigning new features to existing one using methods' did not match any file(s) known to git